## Reading Excel Files

In [1]:
import pandas as pd
import xlrd
df = pd.read_excel('salaries.xlsx', sheet_name='Sheet1') # find the file attached to this lecture
df

         Name  Salary  Country
0      Marry    40000      USA
1   Elizabeth   32000   Brazil
2     Andreas   45000  Germany
3       Diana   54000      USA
4        Mark   72000      USA
5         Dan   62000   Brazil
6      Eduard   81000  Germany
7       Julia   55000      USA
8     Antonio   35000  Germany
9         Ben   48000   Brazil
10       John   61000       UK
11     George   71000       UK
12     Oliver   49000       UK

In [2]:
df['Salary'].mean()

54230.769230769234

In [12]:
df['Salary'].max()

81000

In [13]:
df.Salary.min()

32000

In [14]:
df['Salary'].count()

13

In [15]:
df['Salary'].std()

14827.64223870317

In [18]:
x = df['Country'].unique()
type(x)

numpy.ndarray

In [19]:
list(x)

['USA', 'Brazil', 'Germany', 'UK']

In [20]:
len(x)

4

In [21]:
df['Country'].nunique()

4

In [22]:
df['Country'].value_counts()

USA        4
Germany    3
Brazil     3
UK         3
Name: Country, dtype: int64

In [23]:
df[ (df['Salary']>50000) & (df['Country']=='UK')]

      Name  Salary Country
10    John   61000      UK
11  George   71000      UK

In [24]:
mask = (df['Salary']>50000) & (df['Country']=='UK')

In [25]:
mask

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
12    False
dtype: bool

In [26]:
type(mask)

pandas.core.series.Series

In [27]:
df[mask]

      Name  Salary Country
10    John   61000      UK
11  George   71000      UK

In [29]:
df.sort_values('Salary', ascending=False)

         Name  Salary  Country
6      Eduard   81000  Germany
4        Mark   72000      USA
11     George   71000       UK
5         Dan   62000   Brazil
10       John   61000       UK
7       Julia   55000      USA
3       Diana   54000      USA
12     Oliver   49000       UK
9         Ben   48000   Brazil
2     Andreas   45000  Germany
0      Marry    40000      USA
8     Antonio   35000  Germany
1   Elizabeth   32000   Brazil

In [30]:
df.sort_values('Name')

         Name  Salary  Country
2     Andreas   45000  Germany
8     Antonio   35000  Germany
9         Ben   48000   Brazil
5         Dan   62000   Brazil
3       Diana   54000      USA
6      Eduard   81000  Germany
1   Elizabeth   32000   Brazil
11     George   71000       UK
10       John   61000       UK
7       Julia   55000      USA
4        Mark   72000      USA
0      Marry    40000      USA
12     Oliver   49000       UK

### GroupBy

In [31]:
c = df.groupby('Country')

In [32]:
type(c)

pandas.core.groupby.generic.DataFrameGroupBy

In [33]:
c.max()

              Name  Salary
Country
Brazil   Elizabeth   62000
Germany     Eduard   81000
UK          Oliver   71000
USA         Marry    72000

In [34]:
c.min()

            Name  Salary
Country
Brazil       Ben   32000
Germany  Andreas   35000
UK        George   49000
USA        Diana   40000

In [35]:
c.mean()

               Salary
Country
Brazil   47333.333333
Germany  53666.666667
UK       60333.333333
USA      55250.000000

In [36]:
c.std()

               Salary
Country
Brazil   15011.106999
Germany  24193.663082
UK       11015.141095
USA      13098.982149

In [37]:
df1 = c.max()
df1

              Name  Salary
Country
Brazil   Elizabeth   62000
Germany     Eduard   81000
UK          Oliver   71000
USA         Marry    72000

In [38]:
df1.loc['UK']

Name      Oliver
Salary     71000
Name: UK, dtype: object

In [39]:
df.groupby('Country').min().loc['USA']

Name      Diana
Salary    40000
Name: USA, dtype: object

In [41]:
df.groupby('Country').describe()

        Salary                                                         \
         count          mean           std      min      25%      50%
Country
Brazil     3.0  47333.333333  15011.106999  32000.0  40000.0  48000.0
Germany    3.0  53666.666667  24193.663082  35000.0  40000.0  45000.0
UK         3.0  60333.333333  11015.141095  49000.0  55000.0  61000.0
USA        4.0  55250.000000  13098.982149  40000.0  50500.0  54500.0


             75%      max
Country
Brazil   55000.0  62000.0
Germany  63000.0  81000.0
UK       66000.0  71000.0
USA      59250.0  72000.0

In [42]:
df.groupby('Country').describe().transpose()

Country             Brazil       Germany            UK           USA
Salary count      3.000000      3.000000      3.000000      4.000000
       mean   47333.333333  53666.666667  60333.333333  55250.000000
       std    15011.106999  24193.663082  11015.141095  13098.982149
       min    32000.000000  35000.000000  49000.000000  40000.000000
       25%    40000.000000  40000.000000  55000.000000  50500.000000
       50%    48000.000000  45000.000000  61000.000000  54500.000000
       75%    55000.000000  63000.000000  66000.000000  59250.000000
       max    62000.000000  81000.000000  71000.000000  72000.000000